<a href="https://colab.research.google.com/github/PalomiBollapalli/B19_1233/blob/main/lab4.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [1]:
import pandas as pd
data=[10,20,30,40,50]
series=pd.Series(data)
print(series)

0    10
1    20
2    30
3    40
4    50
dtype: int64

In [2]:
import pandas as pd
data=[10,20,30,40,50]
index_labels=['a','b','c','d','e']
series=pd.Series(data,index=index_labels)
print(series)

a    10
b    20
c    30
d    40
e    50
dtype: int64

In [3]:
data={
    'name':['alice','bob','charlie'],
    'age':[25,30,35],
    'city':['New York','San Francisco','Los Angeles']
}
df=pd.DataFrame(data)
print(df)

      name  age           city
0    alice   25       New York
1      bob   30  San Francisco
2  charlie   35    Los Angeles

In [4]:
print(df['name'])

0      alice
1        bob
2    charlie
Name: name, dtype: object

In [6]:
print(df[['name','city']])
print(df.iloc[1])
print(df.iloc[2])

      name           city
0    alice       New York
1      bob  San Francisco
2  charlie    Los Angeles
name              bob
age                30
city    San Francisco
Name: 1, dtype: object
name        charlie
age              35
city    Los Angeles
Name: 2, dtype: object

In [7]:
df['salary']=[40000,50000,60000]
print(df)

      name  age           city  salary
0    alice   25       New York   40000
1      bob   30  San Francisco   50000
2  charlie   35    Los Angeles   60000

In [8]:
df=df.drop('city',axis=1)
print(df)

      name  age  salary
0    alice   25   40000
1      bob   30   50000
2  charlie   35   60000

In [9]:
print(df[df['age']>30])

      name  age  salary
2  charlie   35   60000

In [10]:
print(df['age'].mean())
print(df['age'].max())
print(df['age'].min())

30.0
35
25

In [11]:
import pandas as pd
student_data={
    'student_id':[101,102,103],
    'name':['Alice','Bob','Charlie'],
    'marks':[85,90,78],
    'department':['CSE','ECE','MECH']
}
df=pd.DataFrame(student_data)
print(df)

   student_id     name  marks department
0         101    Alice     85        CSE
1         102      Bob     90        ECE
2         103  Charlie     78       MECH

In [14]:
print(df[df['marks']>80])
print("\navg marks:",df['marks'].mean())
df['result']=['pass' if x > 40 else 'fail ' for x in df['marks']]
print(df)

   student_id   name  marks department result
0         101  Alice     85        CSE   pass
1         102    Bob     90        ECE   pass

avg marks: 84.33333333333333
   student_id     name  marks department result
0         101    Alice     85        CSE   pass
1         102      Bob     90        ECE   pass
2         103  Charlie     78       MECH   pass

In [16]:
import pandas as pd

data = {
    "sname": ["nani", "ram", "suriya", "vijay","sam"],
    "sroll": [101, 102, 103, 104],
    "m1": [55, 35, 72, 90],
    "m2": [65, 45, 60, 85],
    "m3": [70, 38, 50, 95]
}
df = pd.DataFrame(data)
df["total"] = df[["m1", "m2", "m3"]].sum(axis=1)
df["avg"] = df["total"] / 3
#df["result"] = df['result']=['pass' if m1 > 40 else 'fail ' for x in df['marks']]
print(df)

   sname  sroll  m1  m2  m3  total        avg
0   nani    101  55  65  70    190  63.333333
1    ram    102  35  45  38    118  39.333333
2  surja    103  72  60  50    182  60.666667
3  vijay    104  90  85  95    270  90.000000